In [1]:
import pandas as pd

In [2]:
data = pd.read_excel(r'C:\Users\nithi\OneDrive\Documents\Task-7.xlsx')
data

,Address,Date,Time
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec

#variable creation
#convert single variable into multiple variables

In [3]:
Address = list(data.Address)
Address

['56th street, ben colony, btm layout, bangalore, 78909',
 '20th steet, johns road, whitefield, bangalore, 56795']

In [4]:
lane_no = []
street = []
area = []
city = []
code = []

for i in Address:
    a = i.split(",")  #convert string into substrings
    lane_no.append(a[0])
    street.append(a[1])
    area.append(a[2])
    city.append(a[3])
    code.append(a[4])
    print("substrings of address list :", a)
print('multiple variable created from 1 variable')
print(lane_no)
print(street)
print(area)
print(city)
print(code)

substrings of address list : ['56th street', ' ben colony', ' btm layout', ' bangalore', ' 78909']
substrings of address list : ['20th steet', ' johns road', ' whitefield', ' bangalore', ' 56795']
multiple variable created from 1 variable
['56th street', '20th steet']
[' ben colony', ' johns road']
[' btm layout', ' whitefield']
[' bangalore', ' bangalore']
[' 78909', ' 56795']

In [5]:
data['lane number'] = lane_no
data['Street'] = street
data['Area'] = area
data['City'] = city
data['Pincode'] = code

In [6]:
data

,Address,Date,Time,lane number,Street,Area,City,Pincode
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec,56th street,ben colony,btm layout,bangalore,78909
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec,20th steet,johns road,whitefield,bangalore,56795

In [7]:

Date = list(data.Date)
Date

['3rd Apr 2022', '6th Dec 2021']

In [8]:
day = []
month = []
year = []

for i in Date:
    a= i.split()
    day.append(a[0])
    month.append(a[1])
    year.append(a[2])
print(day)
print(month)
print(year)

['3rd', '6th']
['Apr', 'Dec']
['2022', '2021']

In [9]:
data['dd'] = day
data['mm'] = month
data['yy'] = year

In [10]:
data

,Address,Date,Time,lane number,Street,Area,City,Pincode,dd,mm,yy
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021

In [11]:
Time = list(data.Time)
Time

['5hr 55min 8sec', '2hr 30min 24sec']

In [12]:
hour = []
minutes = []
seconds = []

for i in Time:
    a=i.split()
    hour.append(a[0])
    minutes.append(a[1])
    seconds.append(a[2])
print(hour)
print(minutes)
print(seconds)

['5hr', '2hr']
['55min', '30min']
['8sec', '24sec']

In [13]:
data['hh'] = hour
data['mi'] = minutes
data['ss'] = seconds

In [14]:
data

,Address,Date,Time,lane number,Street,Area,City,Pincode,dd,mm,yy,hh,mi,ss
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec

In [15]:
data

,Address,Date,Time,lane number,Street,Area,City,Pincode,dd,mm,yy,hh,mi,ss
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec

In [16]:
type(data)

pandas.core.frame.DataFrame

In [17]:
var_creat = data.drop(['Address', 'Date', 'Time'], axis=1)
var_creat

,lane number,Street,Area,City,Pincode,dd,mm,yy,hh,mi,ss
0,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec

In [18]:
data

,Address,Date,Time,lane number,Street,Area,City,Pincode,dd,mm,yy,hh,mi,ss
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec

In [19]:
var_creat

,lane number,Street,Area,City,Pincode,dd,mm,yy,hh,mi,ss
0,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec

# Another Method

In [1]:
import pandas as pd

In [2]:
d = pd.read_excel(r'C:\Users\nithi\OneDrive\Documents\Task-7.xlsx')

In [3]:
d

,Address,Date,Time
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec

In [4]:
type(d)

pandas.core.frame.DataFrame

In [4]:
d[['House num','Street','Area','City','code']] = d['Address'].str.split(',', expand=True)
d[['Day','Month','year']] = d['Date'].str.split(expand = True)
d[['Hr','Min','sec']] = d['Time'].str.split(expand = True)
d

,Address,Date,Time,House num,Street,Area,City,code,Day,Month,year,Hr,Min,sec
0,"56th street, ben colony, btm layout, bangalore...",3rd Apr 2022,5hr 55min 8sec,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,"20th steet, johns road, whitefield, bangalore,...",6th Dec 2021,2hr 30min 24sec,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec

In [7]:
clean_data= d.drop(['Address','Date','Time'], axis =1)
clean_data

,House num,Street,Area,City,code,Day,Month,year,Hr,Min,sec
0,56th street,ben colony,btm layout,bangalore,78909,3rd,Apr,2022,5hr,55min,8sec
1,20th steet,johns road,whitefield,bangalore,56795,6th,Dec,2021,2hr,30min,24sec